app/views/article/edit.html.erb

SELECT "groups".* FROM "groups"
---
    <%= label_tag "group" %>
    <%= select_tag 'group_id',options_from_collection_for_select(Group.all, :id, :name ) %>