app/views/article/grouparticle.html.erb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 317], ["LIMIT", 1]]
---
      <% @grouparticle.each do |articles| %>
          <% article = Article.find_by(id: articles.article_id) %>