app/views/article/new.html.erb

    <%= label_tag "group" %>
    <%= select_tag 'group_id',options_from_collection_for_select(Group.all, :id, :name)  %>
---
SELECT "groups".* FROM "groups"