app/views/group/index.html.erb

<% if session["user_id"].present? %>
<% if User.find_by(id: session["user_id"]).admin==1 %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 382], ["LIMIT", 1]]