app/views/group/mygroup.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 88], ["LIMIT", 1]]
---

              <td><%= connection.group.name %></td>