app/controllers/article_controller.rb

  def show
    @article = Article.find_by(id: params["id"])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 309], ["LIMIT", 1]]

  def myarticle
    if session["user_id"].present?
      uid = session["user_id"]
      @article = Article.where(user_id: uid).find_each
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."id" ASC LIMIT ?  [["user_id", 336], ["LIMIT", 1000]]

  def grouparticle

    @grouparticle = GroupArticle.where(group_id: params["group_id"]).find_each
    if params["page"].present?
      page_number = params["page"].to_i
      @grouparticle = @grouparticle.limit(5).offset(5*page_number)
---
SELECT  "group_articles".* FROM "group_articles" WHERE "group_articles"."group_id" = ? ORDER BY "group_articles"."id" ASC LIMIT ?  [["group_id", 91], ["LIMIT", 1000]]
SELECT "articles".* FROM "articles" WHERE "articles"."article_id" = ?  [["article_id", 1]]

  def edit
    @article = Article.find_by(id: params["id"])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 302], ["LIMIT", 1]]

  def like
    @article = Article.find_by(id: params["id"])
    @article.like = @article.like+1
    @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 353], ["LIMIT", 1]]
UPDATE "articles" SET "like" = ? WHERE "articles"."id" = ?  [["like", 1], ["id", 353]]

  def create
    if session["user_id"].present?
      article = Article.new
      article.title = params["title"]
      article.content = params["content"]
      article.post_time = Time.parse(DateTime.now.to_s)
      article.category = params["category"]
      article.user_id = session["user_id"]
      article.url = params["url"]
      article.secret = params["secret"]
      article.key = params["key"]
      article.like = 0
      article.save
    else
      redirect_to "/", notice: "Please log in first!"
    end
    if params["group_id"].present?
      @groupArticle = GroupArticle.new
      @groupArticle.group_id = params["group_id"]
      @groupArticle.article_id = article.id
      @groupArticle.save
---
INSERT INTO "articles" ("title", "content", "post_time", "user_id", "like") VALUES (?, ?, ?, ?, ?)  [["title", "1234"], ["content", "1234"], ["post_time", "2017-05-21 17:06:37 -0500"], ["user_id", 362], ["like", 0]]
INSERT INTO "group_articles" ("group_id", "article_id") VALUES (?, ?)  [["group_id", 91], ["article_id", 317]]

  def update
    @article = Article.find_by(id: params["id"])
    @article.title = params["title"]
    @article.content = params["content"]
    @article.url = params["url"]
    @article.secret = params["secret"]
    @article.key = params["key"]
    @groupArticle = GroupArticle.find_by(article_id: params["id"])
    @groupArticle.group_id = params["group_id"]
    @groupArticle.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 309], ["LIMIT", 1]]
SELECT  "group_articles".* FROM "group_articles" WHERE "group_articles"."article_id" = ? LIMIT ?  [["article_id", 394], ["LIMIT", 1]]
UPDATE "articles" SET "content" = ?, "user_id" = ? WHERE "articles"."id" = ?  [["content", "My first article! hah"], ["user_id", nil], ["id", 349]]
UPDATE "group_articles" SET "group_id" = ? WHERE "group_articles"."id" = ?  [["group_id", 111], ["id", 33]]

  def destroy
    article = Article.find_by(id: params["id"])
    groupArticle = GroupArticle.find_by(article_id: params["id"])
    article.delete
    groupArticle.delete
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 310], ["LIMIT", 1]]
SELECT  "group_articles".* FROM "group_articles" WHERE "group_articles"."article_id" = ? LIMIT ?  [["article_id", 357], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 310]]
DELETE FROM "group_articles" WHERE "group_articles"."id" = ?  [["id", 16]]