app/controllers/connection_controller.rb

	def showmember
		@connection = Connection.where(group_id: params["id"]).find_each
---
SELECT  "connections".* FROM "connections" WHERE "connections"."group_id" = ? ORDER BY "connections"."id" ASC LIMIT ?  [["group_id", 88], ["LIMIT", 1000]]

	def addmember
		if Connection.find_by(group_id: params["group_id"],user_id: session["user_id"]).present?
			redirect_to "/group",notice: "You already in this Group"
		else
		connection = Connection.new
		connection.group_id = params["group_id"]
		connection.user_id = session["user_id"]
		# connection.detail = params["detail"]
		connection.save
---
SELECT  "connections".* FROM "connections" WHERE "connections"."group_id" = ? AND "connections"."user_id" = ? LIMIT ?  [["group_id", 88], ["user_id", 336], ["LIMIT", 1]]
INSERT INTO "connections" ("group_id", "user_id") VALUES (?, ?)  [["group_id", 0], ["user_id", 336]]

	def destroy
  	connection = Connection.find_by(id: params["id"])
    connection.delete
---
SELECT  "connections".* FROM "connections" WHERE "connections"."id" = ? LIMIT ?  [["id", 84], ["LIMIT", 1]]
DELETE FROM "connections" WHERE "connections"."id" = ?  [["id", 84]]