app/controllers/group_controller.rb

	def show
		@group = Group.find_by(id: params["id"])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]

	def edit
		@group = Group.find_by(id: params["id"])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]

	def create
		group = Group.new
		group.name = params["name"]
		group.create_time = Time.parse(DateTime.now.to_s)
---
INSERT INTO "groups" ("name", "create_time", "detail") VALUES (?, ?, ?)  [["name", "PANNA"], ["create_time", "2017-05-21 18:54:46 -0500"], ["detail", "A secret place for us."]]

	def update
		@group = Group.find_by(id: params["id"])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 98], ["LIMIT", 1]]

  def destroy
  	group = Group.find_by(id: params["id"])
    connection = Connection.where(group_id: params["id"])
    group.delete
    connection.delete_all
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 88], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 88]]
DELETE FROM "connections" WHERE "connections"."group_id" = ?  [["group_id", 100]]

  def index
    # page_params = params.permit(:page)
    @group = Group.all
---
SELECT "groups".* FROM "groups"

  def mygroup
    if cookies["user_id"].present?
      uid = cookies["user_id"]
      @connection = Connection.where(user_id: uid).find_each
---
SELECT  "connections".* FROM "connections" WHERE "connections"."user_id" = ? ORDER BY "connections"."id" ASC LIMIT ?  [["user_id", 336], ["LIMIT", 1000]]