app/controllers/session_controller.rb

  def create
    user = User.find_by(mail: params["mail"])
---
SELECT  "users".* FROM "users" WHERE "users"."mail" = ? LIMIT ?  [["mail", "1"], ["LIMIT", 1]]