app/controllers/user_controller.rb

  def show
    @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 336], ["LIMIT", 1]]

  def edit
    @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 336], ["LIMIT", 1]]

  def create
    @user = User.new
    @user.mail = params["mail"]
    @user.name = params["name"]
    @user.admin = 0
    @user.password = params["password"]
    if @user.save
---
INSERT INTO "users" ("name", "mail", "password", "admin") VALUES (?, ?, ?, ?)  [["name", "anna"], ["mail", "anna"], ["password", "anna"], ["admin", 0]]